y=int(input("输入年份"))
m=int(input("输入月份"))
d=int(input("输入日号"))
def jug(y):
    if (y%4==0 and y%100 !=0)or(y%400==0):
        return 1
    else:
        return 0
if jug(y)==1:
    if m==1:
        i=d
    elif m==2:
        i=31+d
    elif m==3:
        i=31+29+d
    elif m==4:
        i=31+29+31+d
    elif m==5:
        i=31+29+31+30+d
    elif m==6:
        i=31+29+31+30+31+d
    elif m==7:
        i=31+29+31+30+31+30+d
    elif m==8:
        i=31+29+31+30+31+30+31+d
    elif m==9:
        i=31+29+31+30+31+30+31+31+d
    elif m==10:
        i=31+29+31+30+31+30+31+31+30+d
    elif m==11:
        i=31+29+31+30+31+30+31+31+30+31+d
    elif m==12:
        i=31+29+31+30+31+30+31+31+30+31+30+d
else:
    if m==1:
        i=d
    elif m==2:
        i=31+d
    elif m==3:
        i=31+28+d
    elif m==4:
        i=31+28+31+d
    elif m==5:
        i=31+28+31+30+d
    elif m==6:
        i=31+28+31+30+31+d
    elif m==7:
        i=31+28+31+30+31+30+d
    elif m==8:
        i=31+28+31+30+31+30+31+d
    elif m==9:
        i=31+28+31+30+31+30+31+31+d
    elif m==10:
        i=31+28+31+30+31+30+31+31+30+d
    elif m==11:
        i=31+28+31+30+31+30+31+31+30+31+d
    elif m==12:
        i=31+28+31+30+31+30+31+31+30+31+30+d
print("这一天是这一年的第%d天"%i)